FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_SAMV71_Xplained_AtmelStudio/libchip_samv7/include/samv7/component/component_tc.h
#define TC_IDR_LOVRS                        ( 0x1u << 1 )  /**< \brief (TC_IDR) Load Overrun */
#define TC_IDR_CPAS                         ( 0x1u << 2 )  /**< \brief (TC_IDR) RA Compare */
#define TC_IDR_CPBS                         ( 0x1u << 3 )  /**< \brief (TC_IDR) RB Compare */
#define TC_IDR_CPCS                         ( 0x1u << 4 )  /**< \brief (TC_IDR) RC Compare */
#define TC_IDR_LDRAS                        ( 0x1u << 5 )  /**< \brief (TC_IDR) RA Loading */
#define TC_IDR_LDRBS                        ( 0x1u << 6 )  /**< \brief (TC_IDR) RB Loading */
#define TC_IDR_ETRGS                        ( 0x1u << 7 )  /**< \brief (TC_IDR) External Trigger */
/* -------- TC_IMR : (TC Offset: N/A) Interrupt Mask Register -------- */
#define TC_IMR_COVFS                        ( 0x1u << 0 )  /**< \brief (TC_IMR) Counter Overflow */
#define TC_IMR_LOVRS                        ( 0x1u << 1 )  /**< \brief (TC_IMR) Load Overrun */
#define TC_IMR_CPAS                         ( 0x1u << 2 )  /**< \brief (TC_IMR) RA Compare */
#define TC_IMR_CPBS                         ( 0x1u << 3 )  /**< \brief (TC_IMR) RB Compare */
#define TC_IMR_CPCS                         ( 0x1u << 4 )  /**< \brief (TC_IMR) RC Compare */
#define TC_IMR_LDRAS                        ( 0x1u << 5 )  /**< \brief (TC_IMR) RA Loading */
#define TC_IMR_LDRBS                        ( 0x1u << 6 )  /**< \brief (TC_IMR) RB Loading */
#define TC_IMR_ETRGS                        ( 0x1u << 7 )  /**< \brief (TC_IMR) External Trigger */
/* -------- TC_EMR : (TC Offset: N/A) Extended Mode Register -------- */
#define TC_EMR_TRIGSRCA_Pos                 0
#define TC_EMR_TRIGSRCA_Msk                 ( 0x3u << TC_EMR_TRIGSRCA_Pos ) /**< \brief (TC_EMR) Trigger Source for Input A */
#define TC_EMR_TRIGSRCA( value )    ( ( TC_EMR_TRIGSRCA_Msk & ( ( value ) << TC_EMR_TRIGSRCA_Pos ) ) )
#define   TC_EMR_TRIGSRCA_EXTERNAL_TIOAx    ( 0x0u << 0 )                   /**< \brief (TC_EMR) The trigger/capture input A is driven by external pin TIOAx */
#define   TC_EMR_TRIGSRCA_PWMx              ( 0x1u << 0 )                   /**< \brief (TC_EMR) The trigger/capture input A is driven internally by PWMx */
#define TC_EMR_TRIGSRCB_Pos                 4
#define TC_EMR_TRIGSRCB_Msk                 ( 0x3u << TC_EMR_TRIGSRCB_Pos ) /**< \brief (TC_EMR) Trigger Source for Input B */
#define TC_EMR_TRIGSRCB( value )    ( ( TC_EMR_TRIGSRCB_Msk & ( ( value ) << TC_EMR_TRIGSRCB_Pos ) ) )
#define   TC_EMR_TRIGSRCB_EXTERNAL_TIOBx    ( 0x0u << 4 )                   /**< \brief (TC_EMR) The trigger/capture input B is driven by external pin TIOBx */
#define   TC_EMR_TRIGSRCB_PWMx              ( 0x1u << 4 )                   /**< \brief (TC_EMR) The trigger/capture input B is driven internally by PWMx */
#define TC_EMR_NODIVCLK                     ( 0x1u << 8 )                   /**< \brief (TC_EMR) No Divided Clock */
/* -------- TC_BCR : (TC Offset: 0xC0) Block Control Register -------- */
#define TC_BCR_SYNC                         ( 0x1u << 0 )                   /**< \brief (TC_BCR) Synchro Command */
/* -------- TC_BMR : (TC Offset: 0xC4) Block Mode Register -------- */
#define TC_BMR_TC0XC0S_Pos                  0
#define TC_BMR_TC0XC0S_Msk                  ( 0x3u << TC_BMR_TC0XC0S_Pos )  /**< \brief (TC_BMR) External Clock Signal 0 Selection */
#define TC_BMR_TC0XC0S( value )    ( ( TC_BMR_TC0XC0S_Msk & ( ( value ) << TC_BMR_TC0XC0S_Pos ) ) )
#define   TC_BMR_TC0XC0S_TCLK0              ( 0x0u << 0 )                   /**< \brief (TC_BMR) Signal connected to XC0: TCLK0 */
#define   TC_BMR_TC0XC0S_TIOA1              ( 0x2u << 0 )                   /**< \brief (TC_BMR) Signal connected to XC0: TIOA1 */
#define   TC_BMR_TC0XC0S_TIOA2              ( 0x3u << 0 )                   /**< \brief (TC_BMR) Signal connected to XC0: TIOA2 */
#define TC_BMR_TC1XC1S_Pos                  2
#define TC_BMR_TC1XC1S_Msk                  ( 0x3u << TC_BMR_TC1XC1S_Pos )  /**< \brief (TC_BMR) External Clock Signal 1 Selection */
#define TC_BMR_TC1XC1S( value )    ( ( TC_BMR_TC1XC1S_Msk & ( ( value ) << TC_BMR_TC1XC1S_Pos ) ) )
#define   TC_BMR_TC1XC1S_TCLK1              ( 0x0u << 2 )                   /**< \brief (TC_BMR) Signal connected to XC1: TCLK1 */
#define   TC_BMR_TC1XC1S_TIOA0              ( 0x2u << 2 )                   /**< \brief (TC_BMR) Signal connected to XC1: TIOA0 */
#define   TC_BMR_TC1XC1S_TIOA2              ( 0x3u << 2 )                   /**< \brief (TC_BMR) Signal connected to XC1: TIOA2 */
#define TC_BMR_TC2XC2S_Pos                  4
#define TC_BMR_TC2XC2S_Msk                  ( 0x3u << TC_BMR_TC2XC2S_Pos )  /**< \brief (TC_BMR) External Clock Signal 2 Selection */
#define TC_BMR_TC2XC2S( value )    ( ( TC_BMR_TC2XC2S_Msk & ( ( value ) << TC_BMR_TC2XC2S_Pos ) ) )
#define   TC_BMR_TC2XC2S_TCLK2              ( 0x0u << 4 )                   /**< \brief (TC_BMR) Signal connected to XC2: TCLK2 */
#define   TC_BMR_TC2XC2S_TIOA0              ( 0x2u << 4 )                   /**< \brief (TC_BMR) Signal connected to XC2: TIOA0 */
#define   TC_BMR_TC2XC2S_TIOA1              ( 0x3u << 4 )                   /**< \brief (TC_BMR) Signal connected to XC2: TIOA1 */
#define TC_BMR_QDEN                         ( 0x1u << 8 )                   /**< \brief (TC_BMR) Quadrature Decoder Enabled */
#define TC_BMR_POSEN                        ( 0x1u << 9 )                   /**< \brief (TC_BMR) Position Enabled */
#define TC_BMR_SPEEDEN                      ( 0x1u << 10 )                  /**< \brief (TC_BMR) Speed Enabled */
#define TC_BMR_QDTRANS                      ( 0x1u << 11 )                  /**< \brief (TC_BMR) Quadrature Decoding Transparent */
#define TC_BMR_EDGPHA                       ( 0x1u << 12 )                  /**< \brief (TC_BMR) Edge on PHA Count Mode */
#define TC_BMR_INVA                         ( 0x1u << 13 )                  /**< \brief (TC_BMR) Inverted PHA */
#define TC_BMR_INVB                         ( 0x1u << 14 )                  /**< \brief (TC_BMR) Inverted PHB */
#define TC_BMR_INVIDX                       ( 0x1u << 15 )                  /**< \brief (TC_BMR) Inverted Index */
#define TC_BMR_SWAP                         ( 0x1u << 16 )                  /**< \brief (TC_BMR) Swap PHA and PHB */
#define TC_BMR_IDXPHB                       ( 0x1u << 17 )                  /**< \brief (TC_BMR) Index Pin is PHB Pin */
#define TC_BMR_MAXFILT_Pos                  20
#define TC_BMR_MAXFILT_Msk                  ( 0x3fu << TC_BMR_MAXFILT_Pos ) /**< \brief (TC_BMR) Maximum Filter */
#define TC_BMR_MAXFILT( value )    ( ( TC_BMR_MAXFILT_Msk & ( ( value ) << TC_BMR_MAXFILT_Pos ) ) )
/* -------- TC_QIER : (TC Offset: 0xC8) QDEC Interrupt Enable Register -------- */
#define TC_QIER_IDX                         ( 0x1u << 0 )                      /**< \brief (TC_QIER) Index */
#define TC_QIER_DIRCHG                      ( 0x1u << 1 )                      /**< \brief (TC_QIER) Direction Change */
#define TC_QIER_QERR                        ( 0x1u << 2 )                      /**< \brief (TC_QIER) Quadrature Error */
/* -------- TC_QIDR : (TC Offset: 0xCC) QDEC Interrupt Disable Register -------- */
#define TC_QIDR_IDX                         ( 0x1u << 0 )                      /**< \brief (TC_QIDR) Index */
#define TC_QIDR_DIRCHG                      ( 0x1u << 1 )                      /**< \brief (TC_QIDR) Direction Change */
#define TC_QIDR_QERR                        ( 0x1u << 2 )                      /**< \brief (TC_QIDR) Quadrature Error */
/* -------- TC_QIMR : (TC Offset: 0xD0) QDEC Interrupt Mask Register -------- */
#define TC_QIMR_IDX                         ( 0x1u << 0 )                      /**< \brief (TC_QIMR) Index */
#define TC_QIMR_DIRCHG                      ( 0x1u << 1 )                      /**< \brief (TC_QIMR) Direction Change */
#define TC_QIMR_QERR                        ( 0x1u << 2 )                      /**< \brief (TC_QIMR) Quadrature Error */
/* -------- TC_QISR : (TC Offset: 0xD4) QDEC Interrupt Status Register -------- */
#define TC_QISR_IDX                         ( 0x1u << 0 )                      /**< \brief (TC_QISR) Index */
#define TC_QISR_DIRCHG                      ( 0x1u << 1 )                      /**< \brief (TC_QISR) Direction Change */
#define TC_QISR_QERR                        ( 0x1u << 2 )                      /**< \brief (TC_QISR) Quadrature Error */
#define TC_QISR_DIR                         ( 0x1u << 8 )                      /**< \brief (TC_QISR) Direction */
/* -------- TC_FMR : (TC Offset: 0xD8) Fault Mode Register -------- */
#define TC_FMR_ENCF0                        ( 0x1u << 0 )                      /**< \brief (TC_FMR) Enable Compare Fault Channel 0 */
#define TC_FMR_ENCF1                        ( 0x1u << 1 )                      /**< \brief (TC_FMR) Enable Compare Fault Channel 1 */
/* -------- TC_WPMR : (TC Offset: 0xE4) Write Protection Mode Register -------- */
#define TC_WPMR_WPEN                        ( 0x1u << 0 )                      /**< \brief (TC_WPMR) Write Protection Enable */
#define TC_WPMR_WPKEY_Pos                   8
#define TC_WPMR_WPKEY_Msk                   ( 0xffffffu << TC_WPMR_WPKEY_Pos ) /**< \brief (TC_WPMR) Write Protection Key */
#define TC_WPMR_WPKEY( value )    ( ( TC_WPMR_WPKEY_Msk & ( ( value ) << TC_WPMR_WPKEY_Pos ) ) )
#define   TC_WPMR_WPKEY_PASSWD              ( 0x54494Du << 8 )                 /**< \brief (TC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0. */

/*@}*/


#endif /* _SAMV71_TC_COMPONENT_ */
